In [1]:
import numpy as np
import pandas as pd

In [2]:
lst = [1,2,3,4,5]

In [3]:
np.array(lst)

array([1, 2, 3, 4, 5])

In [4]:
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
[lst,lst,lst]

[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]

In [6]:
pd.DataFrame([lst,lst,lst], columns=['A','B','C','D','E'])

   A  B  C  D  E
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [7]:
df = pd.DataFrame([lst,lst,lst], columns=['A','B','C','D','E'])
df

   A  B  C  D  E
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [8]:
import pandas as pd
lst = ['Geeks', 'For','Geeks']
df = pd.DataFrame(lst)
print(df)

       0
0  Geeks
1    For
2  Geeks

In [9]:
#Pandas Series
#A pandas series is a 1d array capable of holding data of any type(float,integer,string,python objects etc)
#Creating a series using the Pandas Library.
import pandas as pd
import numpy as np
#Creating empty series
ser = pd.Series()
print("Pandas Series: ", ser)
#Simple array
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print("Pandas Series:\n", ser)

Pandas Series:  Series([], dtype: object)
Pandas Series:
 0    g
1    e
2    e
3    k
4    s
dtype: object

In [10]:
#Pandas DataFrame
#A Dataframe is a 2d structure constructed with rows and columns similar to excel spreadsheets
#Creating a DataFrame Using the Pandas Library
import pandas as pd
#calling dataframe constructor
df = pd.DataFrame()
print(df)
#List of strings
lst = ["Geeks","for",'Geeks','is','a','portal','for','geeks']
#calling dataframe constructor on lst
df = pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
        0
0   Geeks
1     for
2   Geeks
3      is
4       a
5  portal
6     for
7   geeks

In [11]:
#Creating an Empty DataFrame
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
#Creating a DataFrame from a List
import pandas as pd
lst = ['Geeks','For','Geeks']
df = pd.DataFrame(lst)
print(df)

       0
0  Geeks
1    For
2  Geeks

In [13]:
#Creating DataFrame from dict of Numpy Array
import numpy as np
import pandas as pd
data = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(data, columns= ['A','B','C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
#Creating a DataFrame from a List of Dictionaries  
import pandas as pd
dict = {'name':["aparna","Pankaj","sudhir","Geeku"],
       'degree': ["MBA","BCA","M.Tech","MBA"],
       'score':[90,40,80,98]}
df = pd.DataFrame(dict)
print(df)

     name  degree  score
0  aparna     MBA     90
1  Pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [15]:
#Python Pandas Series
import pandas as pd
#simple array
data = [1,2,3,4]
ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
#Creating a Pandas Series
#Creating a series from array:in order to create a series from an array,we have to import a numpy module and have to use array() function.
import pandas as pd
import numpy as np
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [17]:
#creating a series from list
#In order to create a series from list, we have to first create a list after that we can create a series from list.
import pandas as pd
#a simple list
list = ['g','e','e','k','s']
#create a series from the list
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [18]:
#Accessing element of Series
#There are two ways through which we can access element of series, they are :
#Accessing Element from Series with Position
#Accessing Element Using Label (index)
#Accessing first 5 elements of Series.
import pandas as pd
import numpy as np
#creating a simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)
#retrieve the first element
print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [19]:
#Accessing Last 10 Elements of Series
import pandas as pd
import numpy as np
#create simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)
print(ser[-10:])

3     k
4     s
5     f
6     o
7     r
8     g
9     e
10    e
11    k
12    s
dtype: object

In [20]:
#Accessing Element Using Label (index) :
#Accessing a single element using index label.
import pandas as pd
import numpy as np
#create a simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
#accessing a element using index element
print(ser[16])

o

In [21]:
#Accessing a Multiple Element Using index Label
import pandas as pd
import numpy as np
#creating simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
#accesing a multiple element using 
#index element
print(ser[[10,11,12,13,14]])

10    g
11    e
12    e
13    k
14    s
dtype: object

In [22]:
#Access Multiple Elements by Providing Label of Index
import pandas as pd
import numpy as np
ser = pd.Series(np.arange(3,9),index = ['a','b','c','d','e','f'])
print(ser[['a','d']])

a    3
d    6
dtype: int32

In [23]:
#Binary Operations on Pandas Series
#Performing Binary Operations
import pandas as pd
ser1 = pd.Series([1,2,3],index=['A','B','C'])
ser2 = pd.Series([4,5,6],index=['A','B','C'])
df_sum = ser1.add(ser2)
print(df_sum)
#Each element of ser1 is added to the corresponding element of ser2 by matching the index labels (A,B,C).

A    5
B    7
C    9
dtype: int64

In [24]:
#Conversion Operation on Series
import pandas as pd
ser = pd.Series([1,2,3,4])
ser = ser.astype(float)
print(ser)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [25]:
#Creating an Empty Pandas Series
import pandas as pd
ser = pd.Series()
print(ser)

Series([], dtype: object)

In [26]:
#Creating a Series from a Numpy Array
import pandas as pd
import numpy as np
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [27]:
#Creating a Series from a List
import pandas as pd
data_list = ['g','e','e','k','s']
ser = pd.Series(data_list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [28]:
#Creating a Series from a Dictionary
import pandas as pd
data_dict = {'Geeks':10, 'For':20, 'geeks':30}
ser = pd.Series(data_dict)
print(ser)

Geeks    10
For      20
geeks    30
dtype: int64

In [29]:
#Creating a Series Using NumPy Functions
import pandas as pd
import numpy as np
ser = pd.Series(np.linspace(1,10,5))
print(ser)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [30]:
#Creating a Series Using range()
import pandas as pd
ser = pd.Series(range(5,15))
print(ser)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [31]:
#Creating a Series Using List Comprehension
import pandas as pd
ser = pd.Series(range(1,20,3),index=[x for x in 'abcdefg'])
print(ser)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [35]:
import pandas as pd

df = pd.read_csv('nba.csv') 
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [1]:
#Python | Pandas Dataframe/Series.head() method
import pandas as pd
data = pd.read_csv('nba.csv')
data_top = data.head()
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [3]:
#Calling on Series with n parameter()
import pandas as pd
data = pd.read_csv('nba.csv')
#number of rows to return
n = 9
# creating Series
Series = data["Name"]
# returning top n rows
top = Series.head(n = n)
#display
top

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
Name: Name, dtype: object

In [5]:
#Pandas Dataframe/Series.tail() method – Python
import pandas as pd
data = pd.read_csv('nba.csv')
print(data.tail())

             Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

In [8]:
#Getting the Last 12 Rows of a Series
import pandas as pd
data = pd.read_csv('nba.csv')
n = 12
Series = data["Team"]
print(Series.tail(n))

446    Utah Jazz
447    Utah Jazz
448    Utah Jazz
449    Utah Jazz
450    Utah Jazz
451    Utah Jazz
452    Utah Jazz
453    Utah Jazz
454    Utah Jazz
455    Utah Jazz
456    Utah Jazz
457          NaN
Name: Team, dtype: object

In [8]:
#Pandas DataFrame describe() Method
import pandas as pd
#Reading the CSV File
data = pd.read_csv('nba.csv')
#Displaying the first few rows of the dataset
print('NBA Dataset: ')
display(data.head())
print(" \n Summarry Table Generated by .describe() Method: ")
display(data.describe())
#Descriptive Statistics for Numerical Columns generated using .describe() Method
#count: Total number of non-null values in the column.
#mean: Average value of the column.
#std: Standard deviation, showing how spread out the values are.
#min: Minimum value in the column.
#25%: 25th percentile (Q1).
#50%: Median value (50th percentile).
#75%: 75th percentile (Q3).
#max: Maximum value in the column.

NBA Dataset:

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

 Summarry Table Generated by .describe() Method:

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [11]:
#Customizing describe() Method with Percentiles
#You can customize the describe() method to include specific percentiles by passing a list to the percentiles parameter. 
#Here’s an example:
percentiles = [.20, .40, .60, .80]
include = ['object', 'float', 'int']

desc = data.describe(percentiles=percentiles, include=include)

print(desc)

                 Name                  Team      Number Position         Age  \
count             457                   457  457.000000      457  457.000000
unique            457                    30         NaN        5         NaN
top     Avery Bradley  New Orleans Pelicans         NaN       SG         NaN
freq                1                    19         NaN      102         NaN
mean              NaN                   NaN   17.678337      NaN   26.938731
std               NaN                   NaN   15.966090      NaN    4.404016
min               NaN                   NaN    0.000000      NaN   19.000000
20%               NaN                   NaN    4.000000      NaN   23.000000
40%               NaN                   NaN   10.000000      NaN   25.000000
50%               NaN                   NaN   13.000000      NaN   26.000000
60%               NaN                   NaN   18.600000      NaN   27.000000
80%               NaN                   NaN   30.000000      NaN   30.000000
max               NaN                   NaN   99.000000      NaN   40.000000

       Height      Weight   College        Salary
count     457  457.000000       373  4.460000e+02
unique     18         NaN       118           NaN
top       6-9         NaN  Kentucky           NaN
freq       59         NaN        22           NaN
mean      NaN  221.522976       NaN  4.842684e+06
std       NaN   26.368343       NaN  5.229238e+06
min       NaN  161.000000       NaN  3.088800e+04
20%       NaN  195.600000       NaN  9.472760e+05
40%       NaN  213.400000       NaN  1.938840e+06
50%       NaN  220.000000       NaN  2.839073e+06
60%       NaN  230.000000       NaN  3.815000e+06
80%       NaN  245.000000       NaN  8.042895e+06
max       NaN  307.000000       NaN  2.500000e+07

In [12]:
#Describing Series of Strings (Object Data Type)
#If you want to describe a column with string data (i.e., an object data type), the output will be different. Here’s an example using the “Name” column from the dataset:
desc = data["Name"].describe()
print(desc)

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [13]:
#Dealing with Rows and Columns in Pandas DataFrame
#Dealing with Columns
#Column Selection
import pandas as pd
data = {'Name': ['Jai', 'Princi','Gaurav','Anuj'],
       'Age':[27,24,22,32],
       'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
       'Qualification':['Msc','MA','MCA','Phd']}
#convert the dictionary into a DataFrame
df = pd.DataFrame(data)
#select two columns
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [15]:
#In Order to add a column in Pandas DataFrame, we can declare a new list as a column and add to a existing Dataframe.
import pandas as pd
# define a dictionary containing students data
data = {'Name': ['Jai','Princi','Gaurav','Anuj'],
       'Height': [5.1,6.2,5.1,5.2],
       'Qualification': ['Msc','MA','Msc','Msc']}
#convert the dictionary into a DataFrame
df = pd.DataFrame(data)
#Declare a list that is to be converted into a column
address = ['Delhi','Kanpur','Allahabad','Kannauj']
#using Address as the column name and equating it to the list
df['Adress'] = address
#observe the result
print(df)

     Name  Height Qualification     Adress
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA     Kanpur
2  Gaurav     5.1           Msc  Allahabad
3    Anuj     5.2           Msc    Kannauj

In [19]:
#In Order to delete a column in Pandas DataFrame, we can use the drop() method.
import pandas as pd
#making a DataFrame from the csv file
data = pd.read_csv('nba.csv', index_col="Name")
#dropping passed columns
data.drop(["Team", "Weight"], axis = 1, inplace = True)
#display
print(data)

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0
...               ...      ...   ...    ...                ...        ...
Shelvin Mack      8.0       PG  26.0    6-3             Butler  2433333.0
Raul Neto        25.0       PG  24.0    6-1                NaN   900000.0
Tibor Pleiss     21.0        C  26.0    7-3                NaN  2900000.0
Jeff Withey      24.0        C  26.0    7-0             Kansas   947276.0
NaN               NaN      NaN   NaN    NaN                NaN        NaN

[458 rows x 6 columns]